Repository: tgermer/RandomJokesApp
Catalog: RandomJokesApp/Localizable.xcstrings
Source language: en
Languages: de

source: About Developer
de: Über den Entwickler

source: Click Fetch Joke.
de: Klicke, um einen Witz zu laden.

# copied_to_clipboard
source: Joke copied to clipboard.
de: Der Witz wurde in die Zwischenablage kopiert.

# developer_p1
source: Hi, I’m Tristan, the developer behind ‘JokeFetcher’. I hope you’re enjoying the app!
de: Hallo, ich bin Tristan, der Entwickler hinter ‘JokeFetcher’. Ich hoffe, dir gefällt die App!

# developer_p2
source: I’m new to app development, and ‘JokeFetcher’ is my first small app. It’s a personal project to improve my skills and create something entertaining. Thank you for giving it a try!
de: Ich bin neu in der App-Entwicklung, und ‘JokeFetcher’ ist meine erste kleine App. Sie ist ein persönliches Projekt, um meine Fähigkeiten zu verbessern und gleichzeitig etwas Nützliches und Unterhaltsames zu schaffen. Vielen Dank fürs Ausprobieren!

source: Done
de: Schon fertig

# fetch_joke_button
source: Fetch Joke
de: Lade einen Witz

source: Give Feedback
de: Feedback geben

source: Joke Type
de: Witzkategorie

# jokeType_all
source: Random of all Types
de: Zufällig aus allen Kategorien

# jokeType_dad
source: Dad
de: Vater

# jokeType_general
source: General
de: Allgemein

# jokeType_knockknock
source: Knock-Knock
de: Klopfwitz

# jokeType_programming
source: Programming
de: Programmierung

source: Language
de: Sprache

source: Language Settings
de: Übersetzungseinstellungen

# loading_status
source: Loading…
de: Lädt…

source: No Joke showing?
de: Kein Witz zu sehen?

source: Privacy Policy
de: Datenschutzrichtlinie

source: Punchline
de: Pointe

source: Rate Jokes in App Store
de: Jokes im AppStore bewerten

source: Select a language to translate to
de: Wähle eine Sprache in welche übersetzt werden soll.

source: Select Joke Type
de: Wähle eine Kategorie

source: Settings
de: Einstellungen

source: Show Punchline on Demand
de: Pointe nach Tap

source: Some of these features may be available in the future.
de: Einige dieser Funktionen könnten in Zukunft verfügbar sein.

source: Terms of Use
de: Nutzungsbedingungen

# thinking_status
source: Thinking…
de: Überlegt…

# third_party_libraries_info
source: This app uses the "Official Joke API" from GitHub, provided by David Katz. The source code is licensed under the MIT License. More information can be found at GitHub Repository. MIT License Copyright (c) 2022 David Katz Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
de: Diese App verwendet die "Official Joke API" von GitHub, bereitgestellt von David Katz. Der Quellcode steht unter der MIT-Lizenz. Weitere Informationen finden Sie im GitHub Repository. MIT License Copyright (c) 2022 David Katz Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

source: Translate
de: Übersetzen

source: Translate to
de: Übersetzen in

# translating_status
source: Translating in
de: Übersetze in

source: Translation
de: Übersetzung

# translation_info
source: Please note that the translation of jokes may not always be perfect. Humor and meaning can vary depending on language and culture. Translation is powered by RapidAPI.
de: Bitte beachte, dass die Übersetzung von Witzen nicht immer perfekt ist. Der Humor und die Bedeutung können sich je nach Sprache und Kultur unterscheiden. Übersetzung bereitgestellt von RapidAPI.

# translation_info_native
source: Please note that the translation of jokes may not always be perfect. Humor and meaning can vary depending on language and culture. The translation is shown as a sheet. Translation is powered by RapidAPI.
de: Bitte beachte, dass die Übersetzung von Witzen nicht immer perfekt ist. Der Humor und die Bedeutung können sich je nach Sprache und Kultur unterscheiden. Die Übersetzung wir als Überblendung angezeigt. Übersetzung bereitgestellt von RapidAPI.

source: Use Built-in Translation
de: Integrierte Übersetzung verwenden
